let products = [
	{
		name: "IP65 DS LED 5000К",
		price: 1017.33,
		image: "./img/1.png",
		description: "Вбудовуваний вуличний світлодіодний світильник IP65 DS LED 5000К, металевий з опаловим склом. Декоративна фасадна підсвітка будівель, підсвічування на підставі декоративних уступів на газонах, в зимових садах, оранжереях, підсвічування сходинок, підсвічування доріжок у парках (встановлюються в паркані огорожі), на поїзних або біля входу в будівлю, на ділянку",
	},
	{
		name: "OPL/R ECO LED 1200х600 4000K",
		price: 6945.94,
		image: "./img/2.png",
		description: "Вбудований світильник, який використовується для направленому (освітлення робочого місця), або загального основного освітлення. Світлодіодний світильник OPL/R ECO LED 1200 4000K. Хороша передача кольорів, стабільний потік світла допомагають хорошому якісному освітлення у приміщенні, створення приємної робочої обстановці",
	},
	{
		name: "Армстронг OPL/R ECO LED 300 4000K IP20",
		price: 2350.39,
		image: "./img/3.png",
		description: "Світильник використовуються для офісного освітлення і торгових центрів. Стельові вбудований світлодіодний офісні світильники з опаловий розсіювач з ПММА в металевій рамці. Він ідеально виконає свою головну функцію - офісне освітлення, завдяки гарному рівномірному светораспределению.",
	},
	{
		name: "LED MALL ECO 2х35 IP54 4000K",
		price: 6146.10,
		image: "./img/4.png",
		description: "Стельовий декоративний світильник світлодіодний RKL LED 29 4100К IP40, для загального внутрішнього освітлення в приміщеннях. Допомагає не тільки освітити приміщення гарним яскравим світлом але і створити теплоту затишку в домі, теплоту для спілкування в кафе, барі або в будь-якому місці його використання.",
	},
	{
		name: "Армстронг OPL/R ECO LED 595 4000К IP20",
		price: 3508.05,
		image: "./img/5.png",
		description: "Високоміцний світильник аварійного освітлення ANTARES 4200-4 LED Арт. 4501007060, лаконічної форми, виконаний з полікарбонату, автономного та централізованого дії.   Установка Встановлюються на стіну/стеля або вбудовуються в стіну/стеля повністю і частково з допомогою кліпс ST 21. Вбудований варіант монтажу передбачає також оформлення світильника декоративною рамкою ST 26. Аксесуари (ST 21, ST 26, ST 27) комплектуються окремо. Конструкція Корпус світильника виготовлений з полікарбонату. На панель корпусу виведений світлодіодний индикаторопределения працездатності світильника.Контроль і керування аварійним освітленням здійснюється за допомогою пристрою TELEMANDO. Оптична частина Розсіювач світильника виготовлений з полікарбонату. Піктограми для світильника комплектуються окремо. Тип лампи Газорозрядний джерело світла ( люмінесцентна лампа ).",
	},
	{
		name: "COLIBRI DL LED 11W 4000K",
		price: 947.17,
		image: "./img/6.png",
		description: "Сучасний, растровий вбудований світлодіодний світильник, в підвісні стелі типу «Армстронг». Світильник встановлюється безпосередньо на напрямні підвісної стелі. Застосовуються для загального освітлення громадських приміщень, офісів, холів, коридорів, залів Переваги рішення на модулях ЛСМ «УНІВЕРСАЛЬНИЙ»: Звичний «класичний» дизайн Оптична частина: екрануюча алюмінієва решітка або опаловий розсіювач Застосування в підвісні стелі типу «Армстронг», в підшивних стелях з гіпсокартону за допомогою кліпс або кріплення на поверхню стелі Найменування світильників збігаються з їх люмінесцентними аналогами, що спрощує процес підбору замін Відмінні технічні характеристики і висока енергоефективність роблять світильники привабливими для кінцевого споживача УСТАНОВКА Вбудовуються в підвісні стелі типу «Армстронг або в підшивні стелі з гіпсокартону за допомогою кліпс. КОНСТРУКЦІЯ Суцільнометалевий зварний корпус з листової сталі, покритий білою порошковою фарбою. Усередині корпусу встановлено лінійні світлодіодні модулі та драйвер. ОПТИЧНА ЧАСТИНА Екрануюча сітка виготовлена з дзеркального алюмінію. Встановлюється в корпус прихованими пружинами. Тип світлодіодів: NICHIA SMD. ХАРАКТЕРИСТИКИ Колірна температура – 4000K Індекс передачі кольору – 80",
	},
	{
		name: "OPL/S ECO LED 1200 4000К IP20",
		price: 3858.86,
		image: "./img/7.png",
		description: "Світильник з привабливим, цільним выдутым розсіювачем. Хороший світлодіодний потік і м'яке світло дозволяють використовувати світильник в місцях де не вистачає природного сонячного світла. Призначений для офісного освітлення, холів, торгових залів УСТАНОВКА Кріплення-на поверхню стелі в приміщенні або під навісом. КОНСТРУКЦІЯ Корпус світильника сірого кольору з поліестеру, посиленого скловолокном. ОПТИЧНА ЧАСТИНА Опаловий розсіювач з ПММА виготовлений методом видування. Встановлюється в корпус прихованими пластиковими засувками. ХАРАКТЕРИСТИКИ Колірна температура – До 4000 Індекс передачі кольору – 80",
	},
	{
		name: "RKL LED 29 4100К IP40",
		price: 4209.66,
		image: "./img/8.png",
		description: "Гарна заміна люмінесцентних світильників з T8 лампою, світлодіодний світильник вбудований, з растровою ґратами між якій на підставі корпусу світильника розташовуються світлодіодні модулі, що дозволяє отримати хороший, спрямований потік світла на освітлювану поверхню. Світильник призначений для використання всередині приміщень, в офісно адміністративних центрах, торгових центрах. Переваги рішення на модулях ЛСМ «УНІВЕРСАЛЬНИЙ»: Звичний «класичний» дизайн Оптична частина: екрануюча алюмінієва решітка або опаловий розсіювач Застосування в підвісні стелі типу «Армстронг», в підшивних стелях з гіпсокартону за допомогою кліпс або кріплення на поверхню стелі Найменування світильників збігаються з їх люмінесцентними аналогами, що спрощує процес підбору замін Відмінні технічні характеристики і висока енергоефективність роблять світильники привабливими для кінцевого споживача УСТАНОВКА Вбудовуються в підвісні стелі типу «Армстронг або в підшивні стелі з гіпсокартону за допомогою кліпс. Код замовлення кліпс — 2905000110. КОНСТРУКЦІЯ Суцільнометалевий зварний корпус з листової сталі, покритий порошковою фарбою білого кольору або кольору металік. Усередині корпусу встановлено лінійні світлодіодні модулі та драйвер. ОПТИЧНА ЧАСТИНА Призматичний розсіювач з ПММА в металевій рамці. Тип світлодіодів: NICHIA SMD. ХАРАКТЕРИСТИКИ Колірна температура – 4000K Індекс передачі кольору – 80",
	},
	{
		name: "OPL/S ECO LED 595 4000К IP20",
		price: 3262.49,
		image: "./img/9.png",
		description: "Дуже тонкий, компактний встраиваемы світлодіодний світильник, що вбудовується в підвісні стелі типу «Армстронг» Суцільнометалевий зварний корпус з листової сталі, покритий білою матовою порошковою фарбою. І бипараболические решітки з хорошим відображає і распределяющим ефектом. Допомагає заповнити приміщення рівномірним освітлення. Підходить для внутрішнього освітлення всіх приміщень де важлива хороша освітленість та енергоефективність УСТАНОВКА Накладної або вбудовується в підвісні стелі типу «Армстронг» (PTF LED 595 3M 4000К). Вбудовується в стелі з гіпсокартону (PTF/R LED 595 3M HFD 4000К). КОНСТРУКЦІЯ Суцільнометалевий зварний корпус з листової сталі, покритий білою матовою порошковою фарбою. ОПТИЧНА ЧАСТИНА Матові бипараболические решітки в алюмінієвій рамці. Встановлюються в корпус прихованими пружинами. Високоенергоефективні світлодіодними лінійки LUGA LINE від компанії Vossloh-Schwabe. ХАРАКТЕРИСТИКИ Колірна температура – До 4000 Індекс передачі кольору – >85 Світловіддача – 137 лм/Вт",
	},
	{
		name: "ARS/R UNI LED 595 4000K",
		price: 2876.60,
		image: "./img/10.png",
		description: "Опис ^ Розміри 1270 х 190 х 95 мм Серія світодіодних світильників з розсіювачем Захист IP54 Висока світловіддача. Предназначені для установки в приміщеях з висотою стелі від 2,5 до 4 метрів. Купити ALS.PRS UNI LED 1200 EM 4000K Артикул 1076000040",
	},
];
const list = document.querySelector('.list');
function addFilter() {
	let productsAll = JSON.parse(localStorage.getItem('products'))
	const filterFrom = document.getElementById('from');
	const filterTo = document.getElementById('to');
	localStorage.setItem('products', JSON.stringify(products));
	productsAll = products.filter((item) => Math.round(item.price) >= filterFrom.value && Math.round(item.price) <= filterTo.value ? item : null);
	localStorage.setItem('products', JSON.stringify(productsAll));
	window.location.reload();
}
const deleteFilter = document.getElementById('deleteFilter');
function fillStorage() {
	localStorage.setItem('products', JSON.stringify(products));
	window.location.reload();
}

console.log(products);

let productsUpg = JSON.parse(localStorage.getItem('products')) || products;
list.innerHTML = productsUpg.map((product) =>
	`<div class="block">
		<img src=${product.image} class="shablon">
		<p>${product.name}</p>
		<p>Ціна: ${product.price} грн</p>
		<div class="buttons">
			<button class="detail"> <span>More Detail</span> </button>
			<button class="buy">Add to cart</button>
		</div>
	</div>`
).join('')
var detail = document.getElementsByClassName('details');
const blocks = document.querySelectorAll('.block');

blocks.forEach((block, index) => (
	block.querySelector(".detail").addEventListener("click", (e) => {
		console.log(block);
		location.href = "./detail.html";
		localStorage.setItem('block', JSON.stringify(products[index]));
	}),
	block.querySelector('.buy').addEventListener('click', (e) => {
		const cart = document.getElementById('orders');
		var amountOrders = Number(cart.innerText);
		cart.innerHTML = ++amountOrders;
		console.log(cart.innerText);
		const array = localStorage.getItem("cartArray");
		if (array) {
			localStorage.setItem(
				"cartArray",
				JSON.stringify([...JSON.parse(array), products[index]])
			);
		} else {
			localStorage.setItem("cartArray", JSON.stringify([products[index]]));
		}
	}))
);
const filterFrom = document.getElementById('from');
const filterTo = document.getElementById('to');
